/*
 * Задача 2.5
 *
 * 🡆 Два числа хранятся в виде связных списков, в которых каждый узел представляет один разряд. Все
 * цифры хранятся в обратном порядке, то есть младший разряд (единицы) хранится в начале списка.
 * Напишите функцию, которая суммирует два числа и возвращает результат в виде связного списка.
 *
 * Пример:
 * Ввод: (7->1->6) + (5->9->2), то есть 617 + 295
 * Вывод: 2->1->9, то есть 912
 *
 * Дополнительно
 * Решите задачу, предполагая, что цифры записаны в прямом порядке.
 * Ввод: (6->1->7) + (2->9->5), то есть 617 + 295
 * Вывод: 9->1->2, то есть 912
 */